{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_0_output",
      "blob_weights" : 3,
      "K" : 4,
      "blob_biases" : 1,
      "name" : "Conv_in_0_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "input1",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 5
      },
      "top" : "PReLU_in_0_0_output",
      "type" : "activation",
      "name" : "PReLU_in_0_0",
      "bottom" : "BatchN_in_0_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_1_output",
      "blob_weights" : 9,
      "K" : 8,
      "blob_biases" : 7,
      "name" : "Conv_in_0_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "PReLU_in_0_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 11
      },
      "top" : "PReLU_in_0_1_output",
      "type" : "activation",
      "name" : "PReLU_in_0_1",
      "bottom" : "BatchN_in_0_1_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "PReLU_in_0_1_output",
      "pad_l" : 0,
      "name" : "MaxP_0_0",
      "top" : "MaxP_0_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_2_output",
      "blob_weights" : 15,
      "K" : 8,
      "blob_biases" : 13,
      "name" : "Conv_in_0_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "MaxP_0_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 17
      },
      "top" : "PReLU_in_0_2_output",
      "type" : "activation",
      "name" : "PReLU_in_0_2",
      "bottom" : "BatchN_in_0_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_3_output",
      "blob_weights" : 21,
      "K" : 16,
      "blob_biases" : 19,
      "name" : "Conv_in_0_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "PReLU_in_0_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 23
      },
      "top" : "PReLU_in_0_3_output",
      "type" : "activation",
      "name" : "PReLU_in_0_3",
      "bottom" : "BatchN_in_0_3_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "PReLU_in_0_3_output",
      "pad_l" : 0,
      "name" : "MaxP_0_1",
      "top" : "MaxP_0_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_4_output",
      "blob_weights" : 27,
      "K" : 16,
      "blob_biases" : 25,
      "name" : "Conv_in_0_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "MaxP_0_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 29
      },
      "top" : "PReLU_in_0_4_output",
      "type" : "activation",
      "name" : "PReLU_in_0_4",
      "bottom" : "BatchN_in_0_4_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_5_output",
      "blob_weights" : 33,
      "K" : 32,
      "blob_biases" : 31,
      "name" : "Conv_in_0_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "PReLU_in_0_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 35
      },
      "top" : "PReLU_in_0_5_output",
      "type" : "activation",
      "name" : "PReLU_in_0_5",
      "bottom" : "BatchN_in_0_5_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "PReLU_in_0_5_output",
      "pad_l" : 0,
      "name" : "MaxP_0_2",
      "top" : "MaxP_0_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_6_output",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "name" : "Conv_in_0_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "MaxP_0_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 41
      },
      "top" : "PReLU_in_0_6_output",
      "type" : "activation",
      "name" : "PReLU_in_0_6",
      "bottom" : "BatchN_in_0_6_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_in_0_7_output",
      "blob_weights" : 45,
      "K" : 64,
      "blob_biases" : 43,
      "name" : "Conv_in_0_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "PReLU_in_0_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 47
      },
      "top" : "PReLU_in_0_7_output",
      "type" : "activation",
      "name" : "PReLU_in_0_7",
      "bottom" : "BatchN_in_0_7_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 2,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 2,
      "pad_fill_mode" : 0,
      "bottom" : "PReLU_in_0_7_output",
      "pad_l" : 0,
      "name" : "MaxP_0_3",
      "top" : "MaxP_0_3_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_inter_0_0_output",
      "blob_weights" : 51,
      "K" : 64,
      "blob_biases" : 49,
      "name" : "Conv_inter_0_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "MaxP_0_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 53
      },
      "top" : "PReLU_inter_0_0_output",
      "type" : "activation",
      "name" : "PReLU_inter_0_0",
      "bottom" : "BatchN_inter_0_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_inter_0_1_output",
      "blob_weights" : 57,
      "K" : 96,
      "blob_biases" : 55,
      "name" : "Conv_inter_0_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "PReLU_inter_0_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 59
      },
      "top" : "PReLU_inter_0_1_output",
      "type" : "activation",
      "name" : "PReLU_inter_0_1",
      "bottom" : "BatchN_inter_0_1_output"
    },
    {
      "bottom" : "PReLU_inter_0_1_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "UpS_0_0_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "UpS_0_0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_0_output",
      "blob_weights" : 63,
      "K" : 96,
      "blob_biases" : 61,
      "name" : "Conv_out_0_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "UpS_0_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 65
      },
      "top" : "PReLU_out_0_0_output",
      "type" : "activation",
      "name" : "PReLU_out_0_0",
      "bottom" : "BatchN_out_0_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_1_output",
      "blob_weights" : 69,
      "K" : 64,
      "blob_biases" : 67,
      "name" : "Conv_out_0_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "PReLU_out_0_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 71
      },
      "top" : "PReLU_out_0_1_output",
      "type" : "activation",
      "name" : "PReLU_out_0_1",
      "bottom" : "BatchN_out_0_1_output"
    },
    {
      "bottom" : "PReLU_out_0_1_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "UpS_0_1_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "UpS_0_1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_2_output",
      "blob_weights" : 75,
      "K" : 64,
      "blob_biases" : 73,
      "name" : "Conv_out_0_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "UpS_0_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 77
      },
      "top" : "PReLU_out_0_2_output",
      "type" : "activation",
      "name" : "PReLU_out_0_2",
      "bottom" : "BatchN_out_0_2_output"
    },
    {
      "weights" : {

      },
      "top" : "Concat_5_2_output",
      "type" : "concat",
      "name" : "Concat_5_2",
      "bottom" : "PReLU_in_0_5_output,PReLU_out_0_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_3_output",
      "blob_weights" : 81,
      "K" : 64,
      "blob_biases" : 79,
      "name" : "Conv_out_0_3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Concat_5_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 83
      },
      "top" : "PReLU_out_0_3_output",
      "type" : "activation",
      "name" : "PReLU_out_0_3",
      "bottom" : "BatchN_out_0_3_output"
    },
    {
      "bottom" : "PReLU_out_0_3_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "UpS_0_2_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "UpS_0_2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_4_output",
      "blob_weights" : 87,
      "K" : 32,
      "blob_biases" : 85,
      "name" : "Conv_out_0_4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "UpS_0_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 89
      },
      "top" : "PReLU_out_0_4_output",
      "type" : "activation",
      "name" : "PReLU_out_0_4",
      "bottom" : "BatchN_out_0_4_output"
    },
    {
      "weights" : {

      },
      "top" : "Concat_3_4_output",
      "type" : "concat",
      "name" : "Concat_3_4",
      "bottom" : "PReLU_in_0_3_output,PReLU_out_0_4_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_5_output",
      "blob_weights" : 93,
      "K" : 32,
      "blob_biases" : 91,
      "name" : "Conv_out_0_5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "Concat_3_4_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 95
      },
      "top" : "PReLU_out_0_5_output",
      "type" : "activation",
      "name" : "PReLU_out_0_5",
      "bottom" : "BatchN_out_0_5_output"
    },
    {
      "bottom" : "PReLU_out_0_5_output",
      "scaling_factor_y" : 2,
      "weights" : {

      },
      "mode" : 0,
      "top" : "UpS_0_3_output",
      "scaling_factor_x" : 2,
      "type" : "upsample",
      "name" : "UpS_0_3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_6_output",
      "blob_weights" : 99,
      "K" : 16,
      "blob_biases" : 97,
      "name" : "Conv_out_0_6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "UpS_0_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 101
      },
      "top" : "PReLU_out_0_6_output",
      "type" : "activation",
      "name" : "PReLU_out_0_6",
      "bottom" : "BatchN_out_0_6_output"
    },
    {
      "weights" : {

      },
      "top" : "Concat_1_6_output",
      "type" : "concat",
      "name" : "Concat_1_6",
      "bottom" : "PReLU_in_0_1_output,PReLU_out_0_6_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BatchN_out_0_7_output",
      "blob_weights" : 105,
      "K" : 16,
      "blob_biases" : 103,
      "name" : "Conv_out_0_7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Concat_1_6_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 4,
      "weights" : {
        "params_prelu" : 107
      },
      "top" : "PReLU_out_0_7_output",
      "type" : "activation",
      "name" : "PReLU_out_0_7",
      "bottom" : "BatchN_out_0_7_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "pre_output_output",
      "blob_weights" : 111,
      "K" : 8,
      "blob_biases" : 109,
      "name" : "pre_output",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 2,
      "bottom" : "PReLU_out_0_7_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "output1",
      "type" : "softmax",
      "name" : "OUT",
      "bottom" : "pre_output_output"
    }
  ]
}